Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཕྱག་གི་མཐིལ་ན་ཡིད་བཞིན་ནོར་བུ་བཞིན། །ལས་གང་རྣམ་སྨིན་ཆུང་ངུའི་རྒྱུ་དག་ལས། །འབྲས་བུ་དག་ནི་ཚད་མེད་འབྱིན་པ་དང་། །ཚད་མེད་གང་དག་ཆུང་ངུའི་རྒྱུར་འགྱུར་བ། །དེ་དག་དེ་བཞིན་བདེ་གཤེགས་རབ་ཏུ་མཁྱེན། །
en: As if he has a wish-fulfilling jewel in his own hand. “Even the ripening of the fruits of actions with a minor cause May yield an immeasurable result, And something immeasurable may itself be a trifling cause. The Sugata knows this in detail.

source: ཉན་ཐོས་ཉིད་དུ་འབྲས་བུ་སྨིན་འགྱུར་དང་། །རང་རྒྱལ་བྱང་ཆུབ་རྒྱུར་ནི་གང་འགྱུར་དང་། །བླ་མེད་ཡེ་ཤེས་སྟོབས་ནི་སྦྱིན་འགྱུར་བ། །དེ་དག་མ་ལུས་བདེ་གཤེགས་རབ་ཏུ་མཁྱེན། །
en: “That which will result in a śrāvaka, What is the cause of becoming a pratyekabuddha, And how one achieves the limitless power of wisdom—The Sugata knows this fully.

source: ལས་ཀྱི་རྒྱུ་གང་སྡུག་བསྔལ་སྨིན་བྱེད་པ། །དེ་ཡང་བདེ་བའི་འབྲས་བུ་སྨིན་བྱེད་དང་། །ལས་ཀྱི་རྒྱུ་གང་བདེ་བ་སྨིན་བྱེད་པ། །སྡུག་བསྔལ་འབྲས་བུ་བྱ་བ་ཐམས་ཅད་མཁྱེན། །
en: “There are actions that are the ripening of suffering But will yield the result of happiness. There are actions that are the ripening of happiness But will yield the result of suffering—he knows all these processes.

source: སྡུག་བསྔལ་རྒྱུས་ནི་སྡུག་བསྔལ་ཉིད་གནས་དང་། །བདེ་བའི་རྒྱུས་ཀྱང་བདེ་བ་ཉིད་གནས་དང་། །ལས་ཀྱི་རང་བཞིན་རང་བཞིན་མ་ཡིན་པ། །རྒྱུ་ལྡན་བདེ་བར་གཤེགས་པས་རབ་ཏུ་མཁྱེན། །
en: “A cause of suffering will remain to become suffering, And a cause of happiness will remain to become happiness, But the nature of action is that it has no nature. The Sugata, the master of causes, knows this.

source: འགྲོ་བ་ལྔ་ཡི་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །དུས་གསུམ་སྡུག་བསྔལ་བགྲོད་པ་གང་འཇུག་པ། །ཉམས་མེད་དེ་ཉིད་དེ་བཞིན་གཞན་མིན་པར། །སངས་རྒྱས་མཁྱེན་པས་རྒྱལ་བར་བ་ཏུ་མཁྱེན། །
en: “Throughout the three times, the sentient beings in the five realms Engage in what leads to suffering. With his knowledge of awakening, The Victorious One knows these things infallibly, exactly, and unerringly.

source: ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་གཉིས་པ་སྟེ། སྟོབས་དེ་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་འཁོར་གྱི་ནང་དུ་སེང་གེའི་སྒྲ་ཡང་དག་པར་སྒྲོག་ཅིང་། དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ། ལྷ་འམ། བདུད་དམ། ཚངས་པ་གང་གིས་ཀྱང་འཇིག་རྟེན་འདིར་ཆོས་དང་འཐུན་པར་མ་བསྐོར་བ་ཚངས་པའི་འཁོར་ལོ་རབ་ཏུ་སྐོར་རོ།། །།
en: “This, Śāriputra, is the second of the tathāgatas’ tathāgata powers, and with this power the Tathāgata roars a true lion’s roar in the assembly and turns the holy wheel that no ascetic, brahmin, god, māra, or brahmā of this world has legitimately turned.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་མོས་པ་དུ་མ་དང་། མོས་པ་སྣ་ཚོགས་མཁྱེན་པའི་སྟོབས་ཀྱིས་སེམས་ཅན་གཞན་རྣམས་དང་། གང་ཟག་གཞན་དག་གི་མོས་པ་དུ་མ་དང་། མོས་པ་སྣ་ཚོགས་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། ། སྐྱེས་བུ་གང་ཟག་གང་འདོད་ཆགས་ལ་གནས་ཤིང་ཞེ་སྡང་ལ་མོས་པའང་རྒྱས་པར་བྱ་སྟེ། གཏི་མུག་ལ་གནས་ཤིང་ཞེ་སྡང་ལ་མོས་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “Furthermore, Śāriputra, with his power to know the various different kinds of inclination, the Tathāgata truly knows the various different kinds of inclination of other sentient beings and of other people. The Tathāgata knows that when a person is engrossed in desire he is inclined toward hatred, that when he is engrossed in hatred he is inclined toward desire, that when he is engrossed in confusion he is inclined toward hatred, and so forth.

source: གང་ཟག་གང་མི་དགེ་བ་ལ་གནས་ཤིང་མི་དགེ་བ་ལ་མོས་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། གང་ཟག་གང་དགེ་བ་ལ་གནས་ཤིང་དགེ་བ་ལ་མོས་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། ། གང་ཟག་གང་སྦྱོར་བ་དམན་ཞིང་རྒྱ་ཆེན་པོ་ལ་མོས་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། གང་ཟག་གང་སྦྱོར་བ་རྒྱ་ཆེ་ཞིང་དམན་པ་ལ་མོས་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། གང་ཟག་གང་སྦྱོར་བ་དམན་ཞིང་ཁྱད་པར་ལ་གནས་པར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། མོས་པ་གང་གིས་ཁྱད་པར་ལ་སྦྱོར་བ་དམན་པ་ལ་གནས་པར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། མོས་པ་གང་གིས་ལོག་པ་ཉིད་དུ་ངེས་པའི་ཁམས་ཐོབ་པར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། མོས་པ་གང་གིས་ཡང་དག་པ་ཉིད་དུ་ངེས་པའི་ཁམས་ཐོབ་པར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། མོས་པ་གང་གིས་ཡང་དག་པ་ཉིད་རབ་ཏུ་ངེས་པའི་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། མོས་པ་གང་གིས་འདོད་པའི་ཁམས་སུ་འགྲོ་བར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། མོས་པ་གང་གིས་གཟུགས་ཀྱི་ཁམས་སུ་འགྲོ་བར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། མོས་པ་གང་གིས་གཟུགས་མེད་པའི་ཁམས་སུ་འགྲོ་བར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། མོས་པ་གང་གིས་ཁམས་གསུམ་དུ་འགྲོ་བར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། མོས་པ་གང་གིས་དམན་པ་ལ་སྟེན་ཅིང་དམན་པ་ཉིད་གནོན་པ་དང་། ཁྱད་པར་ལ་སྟེན་ཅིང་ཁྱད་པར་ལ་གནོན་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། མོས་པ་གང་གིས་ཁྱད་པར་དུ་སོང་ནས་དམན་པ་ལ་གནས་པར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། མོས་པ་གང་གིས་སྐྱེ་བ་ཐ་དད་པ་དང་། ཁ་དོག་ཐ་དད་པ་དང་། ཡོངས་སུ་ལོངས་སྤྱོད་པ་ཐ་དད་པ་རབ་ཏུ་འཛིན་པར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། མོས་པ་གང་གིས་རྩེ་མོ་ལས་ཉམས་པར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། མོས་པ་གང་གིས་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། མཁྱེན་ནས་ཀྱང་དེ་བཞིན་དུ་ཆོས་སྟོན་ཏོ། །
en: “The Tathāgata truly knows that when a person engages in what is unwholesome he is inclined toward the unwholesome. The Tathāgata knows that when a person engages in what is wholesome he is inclined toward the wholesome. The Tathāgata knows that those who act in petty ways may be inclined to greatness. The Tathāgata knows that those who act in exalted ways may be inclined to pettiness. The Tathāgata knows those who act in particularly petty ways. The Tathāgata knows those who act in particularly exalted ways, as they really are. The Tathāgata truly knows the sort of inclination that will throw one into a state of certain corruption. The Tathāgata truly knows the sort of inclination that will deliver one into a state of certain perfection. The Tathāgata truly knows the sort of inclination that will deliver one to perfect definitive liberation. The Tathāgata truly knows the sort of inclination that will lead one to enter the realm of desire. The Tathāgata truly knows the sort of inclination that will lead one to enter the realm of form. The Tathāgata truly knows the sort of inclination that will lead one to enter the formless realm. The Tathāgata truly knows the sort of inclination that will lead one to enter the three realms. The Tathāgata truly knows the sort of inclination that is conducive to what is inferior and that will push one in the direction of what is inferior, as well as the inclination that is conducive to what is superior and that will push one in the direction of what is superior. The Tathāgata truly knows the sort of inclination that will cause one to engage in inferior ways when one has reached excellence. The Tathāgata truly knows the sort of inclination that will cause one to acquire various types of rebirth, various types of appearance, and various types of pleasure. The Tathāgata truly knows the sort of inclination that will cause one to fall from exalted states. The Tathāgata truly knows the sort of inclination that will cause one to reach liberation. Based on this knowledge, the Tathāgata then teaches the Dharma.

source: དེ་ལྟར་ན་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་མོས་པ་སྣ་ཚོགས་མཁྱེན་པའི་སྟོབས་གང་ཡིན་པ་དེ་ནི་མཐའ་ཡས་མུ་མེད་དེ། ནམ་མཁའ་དང་མཚུངས་ཤིང་མཉམ་མོ། ། བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་མོས་པ་སྣ་ཚོགས་མཁྱེན་པའི་སྟོབས་དེ་ཐོས་ནས་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ་རངས་པ་རྙེད་ནས་ནམ་མཁའ་ལྟ་བུར་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་ངོ་མཚར་དང་རྨད་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: “Śāriputra, the Tathāgata’s power to know the various different kinds of inclination is as boundless as space. When the bodhisatva learns of this power of the Tathāgata to know the various different kinds of inclination, he develops faith, trust, and confidence, and he is without uncertainty and doubt. The Tathāgata brings him pleasure, joy, and satisfaction, and as this power is as inconceivable as space, he considers it to be truly wondrous and extraordinary.”

source: འཇིག་རྟེན་འདི་མོས་སྣ་ཚོགས་དང་། །དེ་བཞིན་བློ་གྲོས་ཚད་མེད་པ། །དེ་དག་གི་ནི་མོས་པའི་སེམས། །ཐམས་ཅད་འདྲེན་པས་རབ་ཏུ་མཁྱེན། །
en: “The various different inclinations and mental capacities In this world are immeasurable, But still, the leader knows The inclinations in the minds of all.

source: གང་དག་འདོད་ཆགས་མོས་པ་ལ། །ཞེ་སྡང་ལ་ནི་གནས་འགྱུར་དང་། །ཞེ་སྡང་གནས་ཤིང་གཏི་མུག་ལ། །གང་དག་མོས་པ་རབ་ཏུ་མཁྱེན། །
en: “Those who are inclined toward desire Will eventually engage in anger, And when they do They will be inclined toward confusion—this he knows.

source: གཏི་མུག་གནས་ཤིང་འདོད་ཆགས་ཀྱི། །སེམས་རྒྱུད་བསམ་གྱིས་མི་ཁྱབ་པ། །བར་བར་དུ་ནི་འཇུག་པ་དག །
en: “When it is confused, the mental continuum’s Capacity for desire is inconceivable. That they shift continually between these states

source: དེ་དག་འདྲེན་པས་རབ་ཏུ་མཁྱེན། །
en: The leader knows.

source: གང་དག་སྦྱོར་བ་དམན་འགྱུར་ལ། །རྒྱ་ཆེན་ལ་ནི་མོས་པ་དང་། །སྦྱོར་བ་དམ་པ་དེ་དག་གི །དམན་པར་འགྱུར་བ་འདྲེན་པས་མཁྱེན། །
en: “Those who act in petty ways May be inclined toward greatness, Just as those who act in exalted ways May be petty—this the leader knows.

source: ལོག་པའི་རྗེས་སུ་སོང་བ་དང་། །འགྲོ་བ་མེད་པར་བྱུང་བ་དང་། །ཁམས་གསུམ་ལས་ནི་རྣམ་གྲོལ་བའི། །མོས་པ་དག་ཀྱང་རབ་ཏུ་མཁྱེན། །
en: “Having arrived in a state of corruption One will eventually return from that state, And one has the inclination toward liberation From the three realms—this he knows.

source: སྐྱེ་དང་ཁ་དོག་ཐ་དད་དང་། །ཉེ་བར་སྤྱོད་པའི་ཁྱད་པར་དང་། །གང་དག་སྤྱི་བོ་ལས་ཉམས་པ། །རྐང་གཉིས་གཙོ་བོས་རབ་ཏུ་མཁྱེན། །
en: “Their various states of rebirth and appearance, Their different kinds of fortune, And the ways that they can fall from grace— The supreme among men knows this.

source: མོས་པ་སྣ་ཚོགས་རབ་མཁྱེན་ནས། །
en: “Knowing the various inclinations,

source: འདྲེན་པ་ཆོས་རྣམས་སྟོན་པ་མཛད། །
en: The leader then teaches the Dharma.

source: སངས་རྒྱས་ཀྱི་ནི་སྟོབས་གསུམ་ལ། །རྒྱལ་བའི་ཐུགས་སྲས་རབ་ཏུ་མོས། །
en: This is the third power of the Buddha In which the children of the Victorious One have faith.

source: ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་གསུམ་པ་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དེ་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཁྱུ་མཆོག་གི་གནས་སུ་ཞལ་གྱིས་འཆེ་ཞིང་འཁོར་གྱི་ནང་དུ་སེང་གེའི་སྒྲ་ཡང་དག་པར་སྒྲོག་སྟེ དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ། ལྷ་འམ། བདུད་དམ། ཚངས་པའམ། སུས་ཀྱང་འཇིག་རྟེན་དུ་ཆོས་དང་འཐུན་པར་མ་བསྐོར་བ་ཚངས་པའི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་ཏོ། །
en: “This, Śāriputra, is the third of the tathāgatas’ tathāgata powers, and with this tathāgata power the tathāgata, arhat, fully accomplished Buddha asserts the state of the supreme bull, roars a true lion’s roar in the assembly, and turns the holy wheel that no ascetic, brahmin, god, māra, or brahmā of this world has legitimately turned.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་ཁམས་དུ་མ་དང་། །ཁམས་སྣ་ཚོགས་མཁྱེན་པའི་སྟོབས་ཀྱིས་འཇིག་རྟེན་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། ཁམས་གང་གིས་འཇིག་རྟེན་བསོད་ནམས་ཀྱི་འདུ་བྱེད་སོགས་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། ཁམས་གང་གིས་བསོད་ནམས་མ་ཡིན་པའི་འདུ་བྱེད་སོགས་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། ཁམས་གང་གིས་མི་གཡོ་བའི་འདུ་བྱེད་སོགས་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། ཁམས་གང་གིས་འབྱུང་བའི་ཁམས་སུ་འཇོག་པར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “Furthermore, Śāriputra, with his power to know the various different elements, the Tathāgata knows the world as it really is. The Tathāgata truly knows which elements strengthen one’s conditioning for beneficial states. The Tathāgata truly knows which elements strengthen one’s conditioning for non-beneficial states. The Tathāgata truly knows which elements strengthen one’s conditioning for the immovable states. The Tathāgata truly knows which elements will lead one to achieve the element of deliverance.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། ཇི་ལྟར་རབ་ཏུ་མཁྱེན་ཅེ་ན། ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོ་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། ། ཡིད་ཀྱི་ཁམས་དང་། ཆོས་ཀྱི་ཁམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་དུ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། ཇི་ལྟར་རབ་ཏུ་མཁྱེན་ཅེ་ན། ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། ། སའི་ཁམས་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་རབ་ཏུ་མཁྱེན་ཏོ། ། ཇི་ལྟར་རབ་ཏུ་མཁྱེན་ཅེ་ན། ནམ་མཁའི་ཁམས་ཇི་ལྟ་བ་དེ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། ། འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་རབ་ཏུ་མཁྱེན་ཏོ། ། ཇི་ལྟར་རབ་ཏུ་མཁྱེན་ཅེ་ན། ཀུན་ཏུ་རྟོག་པ་ལས་བྱུང་བར་རབ་ཏུ་མཁྱེན་ཏོ། ། འདུས་བྱས་ཀྱི་ཁམས་ནི་མངོན་པར་འདུ་བྱེད་པའི་མཚན་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། ། འདུས་མ་བྱས་ཀྱི་ཁམས་ནི་མངོན་པར་འདུ་མི་བྱེད་པའི་མཚན་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། ། ཀུན་ནས་ཉོན་མོངས་པའི་ཁམས་ནི་ཕྱིས་འབྱུང་བའི་ཉོན་མོངས་པའི་མཚན་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། ། རྣམ་པར་བྱང་བའི་ཁམས་ནི་རང་བཞིན་གྱིས་འོད་གསལ་བའི་མཚན་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། ། འདུ་བྱེད་ཀྱི་ཁམས་ནི་ཚུལ་བཞིན་མ་ཡིན་པ་མ་རིག་པའི་མཚན་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། ། མྱ་ངན་ལས་འདས་པའི་དབྱིངས་ནི་ཚུལ་བཞིན་རིག་པའི་མཚན་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “Moreover, Śāriputra, the Tathāgata knows the eye element, the form element, and the visual consciousness element. How does he know them? He understands that they are empty of anything internal, empty of anything external, and empty of both internal and external. He knows the other elements in the same way, up to and including the mind element, the mental phenomena element, and the mental consciousness element. How does he know them? He understands that they are empty of anything internal, empty of anything external, and empty of both internal and external. He knows the earth element, the water element, the fire element, and the wind element. How does he know them? He understands that they are just like the space element. He knows the realm of desire, the realm of form, and the formless realm. How does he know them? He understands that they arise because of mental constructions. He understands that the element of the conditioned is characterized by the fact that it can function. He understands that the element of the unconditioned is characterized by the fact that it does not function. He understands that the element of defiled mental states is characterized by future afflictions. He understands that the element of purity is characterized by natural brilliance. He understands that the element of the conditioned is characterized by ignorance of superficiality. He understands that the element of nirvāṇa is characterized by genuine awareness.

source: འདི་ལྟར་འཇིག་རྟེན་གནས་པའི་ཁམས་གང་ཡིན་པ་དང་། འཇིག་རྟེན་གནས་པ་ཁམས་གང་ལ་གནས་པ་དང་། ཁམས་གང་ལ་རྗེས་སུ་ཆགས་པ་དང་། ཁམས་གང་ལ་གནས་པ་དང་། ཁམས་གང་ལ་སྦྱོར་བ་དང་། ཁམས་གང་གི་བསམ་པ་དང་། ཁམས་གང་ལ་ངེས་པར་སེམས་པ་དང་། ཁམས་གང་ལ་རྟེན་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། མཁྱེན་ནས་ཀྱང་ཆོས་སྟོན་ཏོ། །
en: “In this way, he truly knows that every element is involved with the world. Being involved with the world means being stuck in the elements. He knows how elements lead one astray, how one gets stuck in them, but also how one can practice with them, how one’s inclinations are connected to them, how one can reflect on them, and how they can provide support. Based on this knowledge, he then teaches the Dharma.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ཁམས་དུ་མ་དང་། ཁམས་སྣ་ཚོགས་མཁྱེན་པའི་སྟོབས་མཐའ་ཡས་མུ་མེད་དེ་ནམ་མཁའ་དང་མཚུངས་ཤིང་མཉམ་མོ། ། བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་ཁམས་དུ་མ་དང་། ཁམས་སྣ་ཚོགས་མཁྱེན་པའི་སྟོབས་ལ་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རངས་པ་རྙེད་ནས་ནམ་མཁའ་ལྟ་བུར་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་ངོ་མཚར་དང་། རྨད་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: “Śāriputra, the Tathāgata’s power to know the various different elements is as boundless as space. Given his power to know the various different elements, the bodhisatva has faith, trust, and confidence, and he is without uncertainty and doubt. The Tathāgata brings him pleasure, joy, and satisfaction, and as this power is as inconceivable as space, he considers it to be truly wondrous and extraordinary.”

source: འཇིག་རྟེན་ཀུན་ན་སེམས་ཅན་གང་། །སྣ་ཚོགས་ཁམས་ལ་གནས་པ་དག །
en: “The sentient beings in all the worlds, The various realms that they inhabit,

source: ཁམས་གང་འཇུག་པ་ཅི་འདྲ་བ། །སངས་རྒྱས་ཀྱིས་ནི་རབ་ཏུ་མཁྱེན། །
en: And how they enter these realms— The Buddha knows this.

source: བསོད་ནམས་བསོད་ནམས་མིན་མི་གཡོ། ། འབྱུང་བར་འགྱུར་བའང་དེ་བཞིན་ཏེ། ། ཁམས་རྣམས་གང་ལ་གནས་ནས་སུ། །མྱ་ངན་འདས་པ་ཞི་ལ་རེག །
en: “He knows, too, where they stand in relation to what is beneficial, What is not beneficial, and what is immovable, As well as deliverance And the encounter with transcendent peace.

source: མིག་གི་ཁམས་དང་གཟུགས་ཀྱི་ཁམས། །མིག་གི་རྣམ་པར་ཤེས་ཉིད་དང་། །རྣ་བ་སྣ་དང་ལྕེ་དང་ལུས། ། ཡིད་ཀྱི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན། །
en: “The eye element, the form element, And the visual consciousness element, The elements of the ear, nose, tongue, body, and mind— These he knows.

source: ཆོས་ཀྱི་ཁམས་དང་ཡིད་ཀྱི་ནི། །རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་མཁྱེན། །
en: “He further knows the element of mental objects, As well as mind consciousness.

source: ནང་གི་ཁམས་ནི་སྟོང་པ་དང་། །ཕྱི་རོལ་དག་ཀྱང་སྟོང་པར་མཁྱེན། །
en: He knows these elements to be empty of anything internal And empty of anything external.

source: ས་དང་ཆུ་དང་མེ་དག་དང་། །རླུང་གི་ཁམས་ཀྱང་དེ་བཞིན་ཏེ། །
en: “It is the same with the element of earth, Of water, fire, and wind—

source: ཁམས་རྣམས་བཞི་པོ་དེ་དག་ནི། །ནམ་མཁའ་མཚུངས་པར་རབ་ཏུ་མཁྱེན། །
en: He knows that these four elements Are just like space.

source: འདོད་པའི་ཁམས་དང་གཟུགས་ཀྱི་ཁམས། །གཟུགས་མེད་པ་ཡི་ཁམས་ཉིད་ཀྱང་། །ཀུན་ཏུ་རྟོག་ལས་བྱུང་བར་ནི། །དེ་ལྟར་སངས་རྒྱས་རབ་ཏུ་མཁྱེན། །
en: “The realm of desire, the realm of form, And the formless realm— The Buddha understands that these Are the outcome of mental constructs.

source: ཇི་ལྟར་ནམ་མཁའ་མཐའ་ཡས་པ། །དེ་བཞིན་ཁམས་རྣམས་མུ་མེད་དེ། །
en: “Just as space is boundless, So, too, are the elements limitless.

source: ཐམས་ཅད་སངས་རྒྱས་རབ་མཁྱེན་ཀྱང་། །མཁྱེན་ཏོ་སྙམ་དུ་རློམ་སེམས་མེད། །
en: Even though the Buddha knows them all, He is not conceited, thinking, ‘I know.’

source: ཁམས་ནི་སྐྱེ་བ་མ་ཡིན་ཞིང་། །རྣམ་པ་ཀུན་ཏུ་འགག་མེད་དེ། །
en: “The realm that does not in any way Involve appearance or cessation

source: ཁམས་འདི་མྱ་ངན་འདས་པར་ནི། །སྐྱེས་བུ་དམ་པས་རབ་ཏུ་མཁྱེན། །
en: Is the realm of nirvāṇa, According to the great one’s knowledge.

source: ཇི་ལྟར་ནམ་མཁའ་མཐའ་ཡས་པ། །སངས་རྒྱས་ཡེ་ཤེས་དེ་འདྲ་སྟེ། །
en: “The sky is boundless, And so, too, is the Buddha’s knowledge.

source: མོས་པ་སྣ་ཚོགས་རབ་སྤྲུལ་པ། །ཡེ་ཤེས་དེས་ནི་རབ་ཏུ་མཁྱེན། །
en: With this knowledge, he knows The various different inclinations.

source: མོས་པ་སྣ་ཚོགས་མཁྱེན་ནས་སུ། །སེམས་ཅན་བྱེ་བ་རྣམ་པར་འདུལ། །སངས་རྒྱས་སྟོབས་ནི་བཞི་པ་ལ། །རྒྱལ་བའི་ཐུགས་སྲས་དད་པར་བྱེད། །
en: “Knowing the different kinds of inclination, He tames millions of beings. The children of the Victorious One have faith In this fourth power of the Buddha.

source: ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཞི་པ་སྟེ། སུས་ཀྱང་འཇིག་རྟེན་འདིར་ཆོས་དང་འཐུན་པ་ཞེས་བྱ་བའི་བར་དུ་རྒྱས་པར་བྱའོ། །
en: “This, Śāriputra, is the fourth of the tathāgatas’ tathāgata powers, and having attained that power he asserts the state of the supreme bull and roars the roar of the true lion, and so forth, until as nobody in this world has legitimately turned.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་རིམ་པ་མཁྱེན་པའི་སྟོབས་ཀྱིས་སེམས་ཅན་གཞན་དང་། གང་ཟག་གཞན་རྣམས་ཀྱི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་རིམ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། ཇི་ལྟར་རབ་ཏུ་མཁྱེན་ཅེ་ན། དབང་པོ་རྟུལ་བའང་རབ་ཏུ་མཁྱེན་ཏོ། ། དབང་པོ་བར་མའང་རབ་ཏུ་མཁྱེན་ཏོ། ། དབང་པོ་རྣོ་བའང་རབ་ཏུ་མཁྱེན་ཏོ། ། དབང་པོ་ཁྱད་པར་དུ་འཕགས་པ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། དབང་པོ་དམན་པའང་རབ་ཏུ་མཁྱེན་ཏོ། ། ཡོངས་སུ་རྟོག་པའི་དབང་པོ་ཇི་ལྟ་བུས་མཐར་ཕྱིན་པའི་འདོད་ཆགས་སྐྱེ་བ་དང་། མཐར་ཕྱིན་པའི་ཞེ་སྡང་སྐྱེ་བ་དང་། མཐར་ཕྱིན་པའི་གཏི་མུག་སྐྱེ་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། ཡོངས་སུ་རྟོག་པའི་དབང་པོ་ཇི་ལྟ་བུས་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་བརྟན་པ་སྐྱེ་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། ཡོངས་སུ་རྟོག་པའི་དབང་པོ་ཇི་ལྟ་བུས་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཡང་བ་སྐྱེ་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། ཡོངས་སུ་རྟོག་པའི་དབང་པོ་ཇི་ལྟ་བུས་སྣྲེལ་ཞིའི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྐྱེ་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། ཡོངས་སུ་རྟོགས་པའི་དབང་པོ་ཇི་ལྟ་བུས་ཚར་བཅད་ཅིང་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྐྱེ་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། དབང་པོ་གང་དག་མི་དགེ་བའི་རྒྱུ་ལས་བྱུང་བ་དང་། དབང་པོ་གང་དག་དགེ་བའི་རྒྱུ་ལས་བྱུང་བ་དང་། དབང་པོ་གང་དག་མི་གཡོ་བའི་རྒྱུ་ལས་བྱུང་བ་དང་། དབང་པོ་གང་དག་འབྱུང་བའི་རྒྱུ་ལས་བྱུང་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “Furthermore, Śāriputra, with his power to know the extent of faculties and vigor, the Tathāgata truly knows the extent of the faculties and vigor of other sentient beings and other people. What does he know in this way? He knows which faculties are dull. He knows which faculties are mediocre. He knows which faculties are sharp. He knows which faculties are exceptional. He knows which faculties are poor. The Tathāgata truly knows what sort of faculty of making assumptions is conducive to extreme desire, to extreme anger, and to extreme delusion. The Tathāgata truly knows what sort of faculty of making assumptions is conducive to fabricated desire, anger, and delusion. The Tathāgata truly knows what sort of faculty of making assumptions is conducive to weak degrees of desire, anger, and delusion. The Tathāgata truly knows what sort of faculty of making assumptions is conducive to varying degrees of desire, anger, and delusion. The Tathāgata truly knows what sort of faculty of making assumptions is conducive to the restraint of desire, anger, and delusion. The Tathāgata truly knows which faculties lead to unwholesome states, which faculties lead to wholesome states, which faculties lead to immovable states, and which faculties lead to deliverance.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་མིག་གི་དབང་པོ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་པ་ནས་གོང་མ་བཞིན་དུ་སྦྱར་ཏེ། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱི་དབང་པོ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། ཕོའི་དབང་པོ་དང་། མོའི་དབང་པོ་དང་། སྲོག་གི་དབང་པོ་དང་། བདེ་བའི་དབང་པོ་དང་། སྡུག་བསྔལ་གྱི་དབང་པོ་དང་། ཡིད་མི་བདེ་བའི་དབང་པོ་དང་། ཡིད་བདེ་བའི་དབང་པོ་དང་། བཏང་སྙོམས་ཀྱི་དབང་པོ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། མི་ཤེས་པ་ཀུན་ཤེས་པར་བྱེད་པའི་དབང་པོ་དང་། ཀུན་ཤེས་པའི་དབང་པོ་དང་། ཀུན་ཤེས་པ་དང་ལྡན་པའི་དབང་པོ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “Moreover, Śāriputra, the Tathāgata has knowledge of the eye faculty as it really is, and he also has knowledge of the faculties of the ear, nose, tongue, body, and mind as they really are. He has knowledge of the female faculty, the male faculty, the faculty of life, the faculty of happiness, the faculty of suffering, the faculty of satisfaction, the faculty of dissatisfaction, and the faculty of equanimity, as they really are. He has knowledge of the faculty of faith, the faculty of vigor, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom as they really are. He knows the faculty that understands what has not been understood, the faculty of understanding, and the faculty of one who understands, as they really are.
